In [1]:
import pandas as pd
import numpy as np

In [13]:
import pandas as pd
# Cria um DataFrame
data = {'Empresa':['GOOGLE','GOOGLE','MICROSOFT','MICROSOFT','FACEBOOK','FACEBOOK','LG','LG'],
       'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah','Lucas','Lucas'],
       'Venda':[200,120,340,124,243,350,100,100]}

In [14]:
df = pd.DataFrame(data)

In [15]:
df

     Empresa     Nome  Venda
0     GOOGLE      Sam    200
1     GOOGLE  Charlie    120
2  MICROSOFT      Amy    340
3  MICROSOFT  Vanessa    124
4   FACEBOOK     Carl    243
5   FACEBOOK    Sarah    350
6         LG    Lucas    100
7         LG    Lucas    100

### groupby
- Agrupando por empresa e somando vendas

In [16]:
df.groupby('Empresa').sum()

           Venda
Empresa
FACEBOOK     593
GOOGLE       320
LG           200
MICROSOFT    464

In [22]:
df.groupby('Nome').sum()

         Venda
Nome
Amy        340
Carl       243
Charlie    120
Lucas      200
Sam        200
Sarah      350
Vanessa    124

In [29]:
df.groupby('Nome').sum().loc['Lucas']

Venda    200
Name: Lucas, dtype: int64

- **.describe**, descreve os dados

In [21]:
df.describe()

            Venda
count    8.000000
mean   197.125000
std    104.237966
min    100.000000
25%    115.000000
50%    162.000000
75%    267.250000
max    350.000000